<a href="https://colab.research.google.com/github/hiiamjay/Machine-Learning/blob/master/Experiments/ML_EXP_1_3_7_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from google.colab import drive 
from google.colab import files

In [8]:
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [14]:
data1=pd.read_csv('/content/gdrive/My Drive/NMIMS/SEM - 5/Machine Learning/Experiments/EXP-1/Datasets/depression.csv')
data2=pd.read_csv('/content/gdrive/My Drive/NMIMS/SEM - 5/Machine Learning/Experiments/EXP-1/Datasets/actor_age.csv')
data3=pd.read_csv('/content/gdrive/My Drive/NMIMS/SEM - 5/Machine Learning/Experiments/EXP-1/Datasets/friends.csv')
data4=pd.read_csv('/content/gdrive/My Drive/NMIMS/SEM - 5/Machine Learning/Experiments/EXP-1/Datasets/grad_data.csv')
data5=pd.read_csv('/content/gdrive/My Drive/NMIMS/SEM - 5/Machine Learning/Experiments/EXP-1/Datasets/ratings.csv')

# **Question 1**

**What are the categorical variables in this dataset?**

In [20]:
data1.head()

   Unnamed: 0  Hospt  Treat  Outcome        Time  AcuteT  Age  Gender
0           1      1      0        1   36.143002     211   33       1
1           2      1      1        0  105.142998     176   49       1
2           3      1      1        0   74.570999     191   50       1
3           4      1      0        1   49.714001     206   29       2
4           5      1      0        0   14.429000      63   29       1

1. HOSPT
2. TREAT
3. Outcome
4. Gender

**2. What are the quantitative variables in this dataset?**

In [21]:
data1.head()

   Unnamed: 0  Hospt  Treat  Outcome        Time  AcuteT  Age  Gender
0           1      1      0        1   36.143002     211   33       1
1           2      1      1        0  105.142998     176   49       1
2           3      1      1        0   74.570999     191   50       1
3           4      1      0        1   49.714001     206   29       2
4           5      1      0        0   14.429000      63   29       1

1. AcuteT
2. Age
3. Time

**3. Describe the distribution of the variable "friends" in dataset - Survey that asked 1,200 U.S. college students about their body perception**



*   No difference-602
*   Opposite sex-434
*   Same sex-164

**4. Describe the distribution of the ages of the Best Actor Oscar winners. Be sure to address shape, center, spread and outliers (Dataset - Best Actor Oscar winners (1970-2013))**

* The List contains 44 Actors with a mean age of 44.98, median age of 43.35 and standard deviation of 9.75
* There is an actor who is exceptionally old with an age of 76 years.

**5. Getting information from the output: a. How many observations are in this data set? b. What is the mean age of the actors who won the Oscar? c. What is the five-number summary of the distribution? (Dataset - Best Actor Oscar winners (1970-2013))**

Data is centered around 42-43, it is right skewed, and ranges from 30 to 75.
* Min.    : 29.00
* 1st Qu. : 38.00
* Median  : 43.50   
* Mean    : 44.98    
* 3rd Qu. : 50.25 
* Max.    : 76.00

**6. Get information from the five-number summary: a. Half of the actors won the Oscar before what age? b. What is the range covered by all the actors' ages? c. What is the range covered by the middle 50% of the ages? (Dataset - Best Actor Oscar winners (1970-2013))**

* Min.    : 29.00
* 1st Qu. : 38.00
* Median  : 43.50   
* Mean    : 44.98    
* 3rd Qu. : 50.25 
* Max.    : 76.00

**7. What are the standard deviations of the three rating distributions? Was your intuition correct? (Dataset - 27 students in the class were asked to rate the instructor on a number scale of 1 to 9)**

* Class 1: 1.568929
* Class 2: 4
* Class 3: 2.631174

**8. Assume that the average rating in each of the three classes is 5 (which should be visually reasonably clear from the histograms), and recall the interpretation of the SD as a "typical" or "average" distance between the data points and their mean. Judging from the table and the histograms, which class would have the largest standard deviation, and which one would have the smallest standard deviation? Explain your reasoning (Dataset - 27 students in the class were asked to rate the instructor on a number scale of 1 to 9)**

* Class 1 has a mean of approximately 5. 
* In class 2 most of the observations are far from mean therefore standard deviation is higher. 
* Class has a mix of both close and far from mean observations. 
* Therefore class 1 has the smallest SD followed by class 3 and class 2